ludagoo/SearaBoom/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# 160 MHz: USB 5 V / 500 mA headroom (Wi-Fi TX is the hog, not the CPU).
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=y
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
# 16 KB still parked HTTP/TLS/lwIP in DRAM. 8 KB leaves DMA/task stacks
# internal; Wi-Fi/lwIP try PSRAM first.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=8192
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=49152

# Dynamic TX is unavailable with SPIRAM_USE_MALLOC. AMPDU is also off at
# runtime (SoftAP + I2S). Keep STA buffers small: 64 kbps AAC.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_STATIC_TX_BUFFER=y
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=0
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=8
# CONFIG_ESP_WIFI_AMPDU_TX_ENABLED is not set
# CONFIG_ESP_WIFI_AMPDU_RX_ENABLED is not set

CONFIG_AUDIO_BOARD_CUSTOM=y
CONFIG_MY_BOARD_SEARABOOM=y

CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y
CONFIG_LWIP_IPV6=n

CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
# Full Mozilla bundle is ~67 KB. We only need Let's Encrypt (OTA/logs)
# and USERTrust RSA (Brasilstream HTTPS fallback).
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_NONE=y
CONFIG_MBEDTLS_CUSTOM_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CUSTOM_CERTIFICATE_BUNDLE_PATH="certs/trusted_roots.pem"
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_MAX_CERTS=8

CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=n
CONFIG_ESP_HTTPS_OTA_DECRYPT_CB=n

CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=15
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=y
CONFIG_FREERTOS_HZ=1000

# Keep I2S feeding during OTA flash writes (cache disabled).
CONFIG_I2S_ISR_IRAM_SAFE=y
CONFIG_SPI_FLASH_ERASE_YIELD_DURATION_MS=5
CONFIG_FREERTOS_ENABLE_BACKWARD_COMPATIBILITY=y
# Poll loop is tiny; 16 KB was leftover headroom that radio later needed.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# WS2812 / RMT
CONFIG_SOC_RMT_SUPPORTED=y

CONFIG_SEARABOOM_WIFI_SSID=""
CONFIG_SEARABOOM_WIFI_PASSWORD=""
CONFIG_LWIP_MAX_SOCKETS=16

CONFIG_SEARABOOM_OTA_URL="https://searaboom.goossen.dev"
# Prefer public HTTPS so AP client-isolation / dual-NIC LAN routing cannot block logs.
# TLS runs after stream is up; mbedtls uses PSRAM (EXTERNAL_MEM_ALLOC).
CONFIG_SEARABOOM_LOG_URL="https://searaboom.goossen.dev"
CONFIG_SEARABOOM_FW_VERSION="0.5.28"

# Default INFO; audio path stays INFO so USB-serial does not starve I2S.
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# OTA app slot is 0x1C0000 (1.75 MB). tune_fill.aac is ~318 KB.
# Debug (-Og) overflowed that slot by 152 KB. Size (-Os) with
# assertions off is the Mini-proven fit (~1% free). Do not rely on a
# gitignored local sdkconfig for this.
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
# CONFIG_COMPILER_OPTIMIZATION_DEBUG is not set
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_DISABLE=y

CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CA_CERT=y